hapaxx11/m1-esp32-brain/sdkconfig.defaults
# ESP32-C6 target
CONFIG_IDF_TARGET="esp32c6"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# SPI
CONFIG_SPI_MASTER_IN_IRAM=y

# CRITICAL (from probe research, esp32_spi_at.md): the secondary USB-Serial/JTAG
# console drives GPIO12/13 = MOSI/MISO and corrupts SPI on the M1 board.
# Disable it, otherwise the link silently fails on real hardware.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Bluetooth LE (NimBLE) — native BadBT HID keyboard + BLE scan
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ENABLE_SAE=y

# Promiscuous mode for monitor/attack features
CONFIG_ESP_WIFI_PROMISCUOUS=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=4

# lwIP — TCP tuning for RPC
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_SO_REUSE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Captive portal: browsers send >512B of request headers; raise the limit
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# Internet passthrough for the WiFi Hotspot (NAT)
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
